export type RegionKey = '서울' | '경기' | '인천';

export const REGIONS: Record<RegionKey, string[]> = {
  '서울': [
    '서울 전체',
    '강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구',
    '노원구', '도봉구', '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구',
    '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구'
  ],
  '경기': [
    '경기 전체',
    '수원시', '성남시', '의정부시', '안양시', '부천시', '광명시', '평택시', '동두천시',
    '안산시', '고양시', '과천시', '구리시', '남양주시', '오산시', '시흥시', '군포시',
    '의왕시', '하남시', '용인시', '파주시', '이천시', '안성시', '김포시', '화성시',
    '광주시', '양주시', '포천시', '여주시', '연천군', '가평군', '양평군'
  ],
  '인천': [
    '인천 전체',
    '중구', '동구', '미추홀구', '연수구', '남동구', '부평구', '계양구', '서구',
    '강화군', '옹진군'
  ]
};
